a-sv/lmcu/device/mcu/STM32/detail/adc.h
#pragma once

namespace detail {

template<module_id _module_id>
ADC_TypeDef *inst()
{
  switch(_module_id)
  {
#if defined(ADC1)
  case module_id::adc1: return ADC1;
#endif

#if defined(ADC2)
  case module_id::adc2: return ADC2;
#endif

#if defined(ADC3)
  case module_id::adc3: return ADC3;
#endif

#if defined(ADC4)
  case module_id::adc4: return ADC4;
#endif
  }
  return nullptr;
}

template<typename _module>
ADC_TypeDef *inst() { return detail::inst<_module::module_id>(); }

template<typename _module>
void enable()
{
  auto inst = detail::inst<_module>();

  inst->CR2 |= ADC_CR2_ADON;
  while((inst->CR2 & ADC_CR2_ADON) == 0)
    ;
}

template<typename _module>
void disable()
{
  auto inst = detail::inst<_module>();

  inst->CR2 &= ~ADC_CR2_ADON;
  while((inst->CR2 & ADC_CR2_ADON) != 0)
    ;
}

template<data_align _data_align, typename _cr2>
void set_data_align(_cr2&& cr2)
{
  if constexpr(_data_align == data_align::right) {
    cr2 &= ~ADC_CR2_ALIGN;
  }
  else {
    cr2 |=  ADC_CR2_ALIGN;
  }
}

template<typename _module, data_align _data_align>
void set_data_align() { set_data_align<_data_align>(detail::inst<_module>()->CR2); }

template<typename _module>
data_align get_data_align()
{
  if((detail::inst<_module>()->CR2 & ADC_CR2_ALIGN) == 0) { return data_align::right; }
  return data_align::left;
}

template<scan _scan, typename _cr1>
void set_scan(_cr1&& cr1)
{
  if constexpr(_scan == scan::disable) {
    cr1 &= ~ADC_CR1_SCAN;
  }
  else {
    cr1 |=  ADC_CR1_SCAN;
  }
}

template<typename _module, scan _scan>
void set_scan() { set_scan<_scan>(detail::inst<_module>()->CR1); }

template<typename _module>
scan get_scan()
{
  if((detail::inst<_module>()->CR1 & ADC_CR1_SCAN) == 0) { return scan::disable; }
  return scan::enable;
}

template<disc_mode _disc_mode, typename _cr1, typename _cr2>
void set_disc_mode(_cr1&& cr1, _cr2&& cr2)
{
  if constexpr(_disc_mode == disc_mode::regular) {
    cr1 |=  ADC_CR1_DISCEN;
  }
  else {
    cr1 &= ~ADC_CR1_DISCEN;
  }

  if constexpr(_disc_mode == disc_mode::injected) {
    cr1 |=  ADC_CR1_JDISCEN;
  }
  else {
    cr1 &= ~ADC_CR1_JDISCEN;
  }

  if constexpr(_disc_mode == disc_mode::disable) {
    cr2 |=  ADC_CR2_CONT;
  }
  else {
    cr2 &= ~ADC_CR2_CONT;
  }
}

template<typename _module, disc_mode _disc_mode>
void set_disc_mode()
{
  auto inst = detail::inst<_module>();
  uint32_t cr1 = inst->CR1, cr2 = inst->CR2;
  set_disc_mode<_disc_mode>(cr1, cr2);
  inst->CR1 = cr1;
  inst->CR2 = cr2;
}

template<typename _module>
disc_mode get_disc_mode()
{
  auto inst = detail::inst<_module>();

  const uint32_t cr1 = inst->CR1;

  if(cr1 & ADC_CR1_DISCEN)  { return disc_mode::regular;  }
  if(cr1 & ADC_CR1_JDISCEN) { return disc_mode::injected; }

  return disc_mode::disable;
}

template<reg_discnum _reg_discnum, typename _cr1>
void set_reg_discnum(_cr1&& cr1)
{
  cr1 &= ~ADC_CR1_DISCNUM;
  cr1 |= (uint32_t(_reg_discnum) << ADC_CR1_DISCNUM_Pos);
}

template<typename _module, reg_discnum _reg_discnum>
void set_reg_discnum()
{
  auto inst = detail::inst<_module>();
  uint32_t cr1 = inst->CR1;
  set_reg_discnum<_reg_discnum>(cr1);
  inst->CR1 = cr1;
}

template<typename _module>
reg_discnum get_reg_discnum()
{
  return reg_discnum( (detail::inst<_module>()->CR1 & ADC_CR1_DISCNUM) >> ADC_CR1_DISCNUM_Pos );
}

template<typename _module>
constexpr void reg_trig_check()
{
#if defined(ADC1)
    if constexpr(
      _module::reg_trig == reg_trig::tim1_cc1          ||
      _module::reg_trig == reg_trig::tim1_cc2          ||
      _module::reg_trig == reg_trig::tim1_cc3          ||
      _module::reg_trig == reg_trig::tim2_cc2          ||
      _module::reg_trig == reg_trig::tim3_trgo         ||
      _module::reg_trig == reg_trig::tim4_cc4          ||
      _module::reg_trig == reg_trig::exti11__tim8_trgo
    ) {
      static_assert(
        _module::module_id == module_id::adc1
  #if defined(ADC2)
        || _module::module_id == module_id::adc2
  #endif
      );
    }
#endif

#if defined(ADC3)
    if constexpr(
      _module::reg_trig == reg_trig::tim3_cc1  ||
      _module::reg_trig == reg_trig::tim2_cc3  ||
      _module::reg_trig == reg_trig::tim1_cc3  ||
      _module::reg_trig == reg_trig::tim8_cc1  ||
      _module::reg_trig == reg_trig::tim8_trgo ||
      _module::reg_trig == reg_trig::tim5_cc1  ||
      _module::reg_trig == reg_trig::tim5_cc3
    ) {
      static_assert(_module::module_id == module_id::adc3);
    }
#endif
}

template<reg_trig _reg_trig, typename _cr2>
void set_reg_trig(_cr2&& cr2)
{
  if constexpr(_reg_trig == reg_trig::disable) {
    cr2 &= ~ADC_CR2_EXTTRIG;
  }
  else {
    cr2 |=  ADC_CR2_EXTTRIG;
    cr2 &= ~ADC_CR2_EXTSEL;
    switch(_reg_trig) {
#if defined(ADC1)
    case reg_trig::tim1_cc2:          cr2 |= (1 << ADC_CR2_EXTSEL_Pos); break;
    case reg_trig::tim1_cc3:          cr2 |= (2 << ADC_CR2_EXTSEL_Pos); break;
    case reg_trig::tim2_cc2:          cr2 |= (3 << ADC_CR2_EXTSEL_Pos); break;
    case reg_trig::tim3_trgo:         cr2 |= (4 << ADC_CR2_EXTSEL_Pos); break;
    case reg_trig::tim4_cc4:          cr2 |= (5 << ADC_CR2_EXTSEL_Pos); break;
    case reg_trig::exti11__tim8_trgo: cr2 |= (6 << ADC_CR2_EXTSEL_Pos); break;
#endif

#if defined(ADC3)
    case reg_trig::tim2_cc3:          cr2 |= (1 << ADC_CR2_EXTSEL_Pos); break;
    case reg_trig::tim1_cc3:          cr2 |= (2 << ADC_CR2_EXTSEL_Pos); break;
    case reg_trig::tim8_cc1:          cr2 |= (3 << ADC_CR2_EXTSEL_Pos); break;
    case reg_trig::tim8_trgo:         cr2 |= (4 << ADC_CR2_EXTSEL_Pos); break;
    case reg_trig::tim5_cc1:          cr2 |= (5 << ADC_CR2_EXTSEL_Pos); break;
    case reg_trig::tim5_cc3:          cr2 |= (6 << ADC_CR2_EXTSEL_Pos); break;
#endif
    case reg_trig::sw_start:          cr2 |= (7 << ADC_CR2_EXTSEL_Pos); break;
    default : break;
    }
  }
}

template<typename _module, reg_trig _reg_trig>
void set_reg_trig()
{
  reg_trig_check<_module>();

  auto inst = detail::inst<_module>();
  uint32_t cr2 = inst->CR2;
  set_reg_trig<_reg_trig>(cr2);
  inst->CR2 = cr2;
}

template<typename _module>
reg_trig get_reg_trig()
{
  const uint32_t cr2 = detail::inst<_module>()->CR2;

  if((cr2 & ADC_CR2_EXTTRIG) == 0) { return reg_trig::disable; }

  constexpr auto adc_1_2 = []
  {
#if defined(ADC1)
    if constexpr(_module::module_id == module_id::adc1) { return true; }
#endif

#if defined(ADC2)
    if constexpr(_module::module_id == module_id::adc2) { return true; }
#endif

