a-sv/lmcu/device/mcu/STM32/detail/adc.h
    return false;
  }();

  if constexpr(adc_1_2) {
    switch(cr2 & ADC_CR2_EXTSEL) {
    case (1 << ADC_CR2_EXTSEL_Pos): return reg_trig::tim1_cc2;
    case (2 << ADC_CR2_EXTSEL_Pos): return reg_trig::tim1_cc3;
    case (3 << ADC_CR2_EXTSEL_Pos): return reg_trig::tim2_cc2;
    case (4 << ADC_CR2_EXTSEL_Pos): return reg_trig::tim3_trgo;
    case (5 << ADC_CR2_EXTSEL_Pos): return reg_trig::tim4_cc4;
    case (6 << ADC_CR2_EXTSEL_Pos): return reg_trig::exti11__tim8_trgo;
    default: break;
    }
  }

#if defined(ADC3)
  if constexpr(_module::module_id == module_id::adc3) {
    switch(cr2 & ADC_CR2_EXTSEL) {
    case (1 << ADC_CR2_EXTSEL_Pos): return reg_trig::tim2_cc3;
    case (2 << ADC_CR2_EXTSEL_Pos): return reg_trig::tim1_cc3;
    case (3 << ADC_CR2_EXTSEL_Pos): return reg_trig::tim8_cc1;
    case (4 << ADC_CR2_EXTSEL_Pos): return reg_trig::tim8_trgo;
    case (5 << ADC_CR2_EXTSEL_Pos): return reg_trig::tim5_cc1;
    case (6 << ADC_CR2_EXTSEL_Pos): return reg_trig::tim5_cc3;
    default: break;
    }
  }
#endif

  if((cr2 & (7 << ADC_CR2_EXTSEL_Pos)) != 0) { return reg_trig::sw_start; }
  return reg_trig::disable;
}

template<typename _module>
constexpr void inj_trig_check()
{
#if defined(ADC1)
    if constexpr(
      _module::inj_trig == inj_trig::tim2_trgo         ||
      _module::inj_trig == inj_trig::tim2_cc1          ||
      _module::inj_trig == inj_trig::tim3_cc4          ||
      _module::inj_trig == inj_trig::tim4_trgo         ||
      _module::inj_trig == inj_trig::exti15__tim8_cc4
    ) {
      static_assert(
        _module::module_id == module_id::adc1
  #if defined(ADC2)
        || _module::module_id == module_id::adc2
  #endif
      );
    }
#endif

#if defined(ADC3)
    if constexpr(
      _module::inj_trig == inj_trig::tim4_cc3  ||
      _module::inj_trig == inj_trig::tim8_cc2  ||
      _module::inj_trig == inj_trig::tim8_cc4  ||
      _module::inj_trig == inj_trig::tim5_trgo ||
      _module::inj_trig == inj_trig::tim5_cc4
    ) {
      static_assert(_module::module_id == module_id::adc3);
    }
#endif
}

template<inj_trig _inj_trig, typename _cr2>
void set_inj_trig(_cr2&& cr2)
{
  if constexpr(_inj_trig == inj_trig::disable) {
    cr2 &= ~ADC_CR2_JEXTTRIG;
  }
  else {
    cr2 |=  ADC_CR2_JEXTTRIG;
    cr2 &= ~ADC_CR2_JEXTSEL;
    switch(_inj_trig) {
    case inj_trig::tim1_cc4:         cr2 |= (1 << ADC_CR2_JEXTSEL_Pos); break;

#if defined(ADC1)
    case inj_trig::tim2_trgo:        cr2 |= (2 << ADC_CR2_JEXTSEL_Pos); break;
    case inj_trig::tim2_cc1:         cr2 |= (3 << ADC_CR2_JEXTSEL_Pos); break;
    case inj_trig::tim3_cc4:         cr2 |= (4 << ADC_CR2_JEXTSEL_Pos); break;
    case inj_trig::tim4_trgo:        cr2 |= (5 << ADC_CR2_JEXTSEL_Pos); break;
    case inj_trig::exti15__tim8_cc4: cr2 |= (6 << ADC_CR2_JEXTSEL_Pos); break;
#endif

#if defined(ADC3)
    case inj_trig::tim4_cc3:         cr2 |= (2 << ADC_CR2_JEXTSEL_Pos); break;
    case inj_trig::tim8_cc2:         cr2 |= (3 << ADC_CR2_JEXTSEL_Pos); break;
    case inj_trig::tim8_cc4:         cr2 |= (4 << ADC_CR2_JEXTSEL_Pos); break;
    case inj_trig::tim5_trgo:        cr2 |= (5 << ADC_CR2_JEXTSEL_Pos); break;
    case inj_trig::tim5_cc4:         cr2 |= (6 << ADC_CR2_JEXTSEL_Pos); break;
#endif
    case inj_trig::jsw_start:        cr2 |= (7 << ADC_CR2_JEXTSEL_Pos); break;
    default: break;
    }
  }
}

template<typename _module, inj_trig _inj_trig>
void set_inj_trig()
{
  inj_trig_check<_module>();

  auto inst = detail::inst<_module>();
  uint32_t cr2 = inst->CR2;
  set_inj_trig<_inj_trig>(cr2);
  inst->CR2 = cr2;
}

template<typename _module>
inj_trig get_inj_trig()
{
  const uint32_t cr2 = detail::inst<_module>()->CR2;

  if((cr2 & ADC_CR2_JEXTTRIG) == 0) { return inj_trig::disable; }

  constexpr auto adc_1_2 = []
  {
#if defined(ADC1)
    if constexpr(_module::module_id == module_id::adc1) { return true; }
#endif

#if defined(ADC2)
    if constexpr(_module::module_id == module_id::adc2) { return true; }
#endif

    return false;
  }();

  if constexpr(adc_1_2) {
    switch(cr2 & ADC_CR2_JEXTSEL) {
    case (2 << ADC_CR2_JEXTSEL_Pos): return inj_trig::tim2_trgo;
    case (3 << ADC_CR2_JEXTSEL_Pos): return inj_trig::tim2_cc1;
    case (4 << ADC_CR2_JEXTSEL_Pos): return inj_trig::tim3_cc4;
    case (5 << ADC_CR2_JEXTSEL_Pos): return inj_trig::tim4_trgo;
    case (6 << ADC_CR2_JEXTSEL_Pos): return inj_trig::exti15__tim8_cc4;
    default: break;
    }
  }

#if defined(ADC3)
  if constexpr(_module::module_id == module_id::adc3) {
    switch(cr2 & ADC_CR2_JEXTSEL) {
    case (2 << ADC_CR2_JEXTSEL_Pos): return inj_trig::tim4_cc3;
    case (3 << ADC_CR2_JEXTSEL_Pos): return inj_trig::tim8_cc2;
    case (4 << ADC_CR2_JEXTSEL_Pos): return inj_trig::tim8_cc4;
    case (5 << ADC_CR2_JEXTSEL_Pos): return inj_trig::tim5_trgo;
    case (6 << ADC_CR2_JEXTSEL_Pos): return inj_trig::tim5_cc4;
    default: break;
    }
  }
#endif

  if((cr2 & (1 << ADC_CR2_JEXTSEL_Pos)) != 0) { return inj_trig::tim1_cc4;  }
  if((cr2 & (7 << ADC_CR2_JEXTSEL_Pos)) != 0) { return inj_trig::jsw_start; }

  return inj_trig::disable;
}

template<inj_auto _inj_auto, typename _cr1>
void set_inj_auto(_cr1&& cr1)
{
  if constexpr(_inj_auto == inj_auto::disable) {
    cr1 &= ~ADC_CR1_JAUTO;
  }
  else {
    cr1 |=  ADC_CR1_JAUTO;
  }
}

template<typename _module, inj_auto _inj_auto>
void set_inj_auto() { set_inj_auto<_inj_auto>(detail::inst<_module>()->CR1); }

template<typename _module>
inj_auto get_inj_auto()
{
  if((detail::inst<_module>()->CR1 & ADC_CR1_JAUTO) == 0) { return inj_auto::disable; }
  return inj_auto::enable;
}

template<dma _dma, typename _cr2>
void set_dma(_cr2&& cr2)
{
  if constexpr(_dma == dma::disable) {
    cr2 &= ~ADC_CR2_DMA;
  }
  else {
    cr2 |=  ADC_CR2_DMA;
  }
}

template<typename _module, dma _dma>
void set_dma() { set_dma<_dma>(detail::inst<_module>()->CR2); }

template<typename _module>
dma get_dma()
{
  if((detail::inst<_module>()->CR2 & ADC_CR2_DMA) == 0) { return dma::disable; }
  return dma::enable;
}

template<dual_mode _dual_mode, typename _cr1>
void set_dual_mode(_cr1&& cr1)
{
  cr1 &= ~ADC_CR1_DUALMOD;
  switch(_dual_mode)
  {
  case dual_mode::regular_and_injected:    cr1 |= (1 << ADC_CR1_DUALMOD_Pos); break;
  case dual_mode::regular_and_trigger:     cr1 |= (2 << ADC_CR1_DUALMOD_Pos); break;
  case dual_mode::injected_and_fast_inter: cr1 |= (3 << ADC_CR1_DUALMOD_Pos); break;
  case dual_mode::injected_and_slow_inter: cr1 |= (4 << ADC_CR1_DUALMOD_Pos); break;
  case dual_mode::injected_only:           cr1 |= (5 << ADC_CR1_DUALMOD_Pos); break;
  case dual_mode::regular_only:            cr1 |= (6 << ADC_CR1_DUALMOD_Pos); break;
  case dual_mode::fast_inter_only:         cr1 |= (7 << ADC_CR1_DUALMOD_Pos); break;
  case dual_mode::slow_inter_only:         cr1 |= (8 << ADC_CR1_DUALMOD_Pos); break;
  case dual_mode::trigger_only:            cr1 |= (9 << ADC_CR1_DUALMOD_Pos); break;
  default: break;
  }
}

