a-sv/lmcu/device/mcu/STM32/detail/adc.h
template<typename _module, dual_mode _dual_mode>
void set_dual_mode()
{
  auto inst = detail::inst<_module>();
  uint32_t cr1 = inst->CR1;
  set_dual_mode<_dual_mode>(cr1);
  inst->CR1 = cr1;
}

template<typename _module>
dual_mode get_dual_mode()
{
  const uint32_t cr1 = detail::inst<_module>()->CR1;

  switch(cr1 & ADC_CR1_DUALMOD) {
  case (1 << ADC_CR1_DUALMOD_Pos): return dual_mode::regular_and_injected;
  case (2 << ADC_CR1_DUALMOD_Pos): return dual_mode::regular_and_trigger;
  case (3 << ADC_CR1_DUALMOD_Pos): return dual_mode::injected_and_fast_inter;
  case (4 << ADC_CR1_DUALMOD_Pos): return dual_mode::injected_and_slow_inter;
  case (5 << ADC_CR1_DUALMOD_Pos): return dual_mode::injected_only;
  case (6 << ADC_CR1_DUALMOD_Pos): return dual_mode::regular_only;
  case (7 << ADC_CR1_DUALMOD_Pos): return dual_mode::fast_inter_only;
  case (8 << ADC_CR1_DUALMOD_Pos): return dual_mode::slow_inter_only;
  case (9 << ADC_CR1_DUALMOD_Pos): return dual_mode::trigger_only;
  default: break;
  }

  return dual_mode::independent;
}

template<temp_refint _temp_refint, typename _cr2>
void set_temp_refint(_cr2&& cr2)
{
  if constexpr(_temp_refint == temp_refint::disable) {
    cr2 &= ~ADC_CR2_TSVREFE;
  }
  else
  if((cr2 & ADC_CR2_TSVREFE) == 0) {
    cr2 |=  ADC_CR2_TSVREFE;
    delay::us(10);
  }
}

template<typename _module, temp_refint _temp_refint>
void set_temp_refint()
{
  auto inst = detail::inst<_module>();
  uint32_t cr2 = inst->CR2;
  set_temp_refint<_module, _temp_refint>(cr2);
  inst->CR2 = cr2;
}

template<typename _module>
temp_refint get_temp_refint()
{
  if((detail::inst<_module>()->CR2 & ADC_CR2_TSVREFE) == 0) { return temp_refint::disable; }
  return temp_refint::enable;
}

template<awd_mode _awd_mode, typename _cr1>
void set_awd_mode(_cr1&& cr1)
{
  cr1 &= ~(ADC_CR1_AWDSGL | ADC_CR1_AWDEN | ADC_CR1_JAWDEN);
  switch(_awd_mode) {
  case awd_mode::all_injected:
    cr1 |= ADC_CR1_JAWDEN;
    break;
  case awd_mode::all_regular:
    cr1 |= ADC_CR1_AWDEN;
    break;
  case awd_mode::all_injected_and_regular:
    cr1 |= (ADC_CR1_AWDEN | ADC_CR1_JAWDEN);
    break;
  case awd_mode::single_injected:
    cr1 |= (ADC_CR1_AWDSGL | ADC_CR1_JAWDEN);
    break;
  case awd_mode::single_regular:
    cr1 |= (ADC_CR1_AWDSGL | ADC_CR1_AWDEN);
    break;
  case awd_mode::single_regular_or_injected:
    cr1 |= (ADC_CR1_AWDSGL | ADC_CR1_AWDEN | ADC_CR1_JAWDEN);
    break;
  default: break;
  }
}

template<typename _module, awd_mode _awd_mode>
void set_awd_mode() { set_awd_mode<_awd_mode>(detail::inst<_module>()->CR1); }

template<typename _module>
awd_mode get_awd_mode()
{
  const uint32_t cr1 = detail::inst<_module>()->CR1;

  switch(cr1 & (ADC_CR1_AWDSGL | ADC_CR1_AWDEN | ADC_CR1_JAWDEN)) {
  case ADC_CR1_JAWDEN:
    return awd_mode::all_injected;
  case ADC_CR1_AWDEN:
    return awd_mode::all_regular;
  case (ADC_CR1_AWDEN | ADC_CR1_JAWDEN):
    return awd_mode::all_injected_and_regular;
  case (ADC_CR1_AWDSGL | ADC_CR1_JAWDEN):
    return awd_mode::single_injected;
  case (ADC_CR1_AWDSGL | ADC_CR1_AWDEN):
    return awd_mode::single_regular;
  case (ADC_CR1_AWDSGL | ADC_CR1_AWDEN | ADC_CR1_JAWDEN):
    return awd_mode::single_regular_or_injected;
  default: break;
  }

  return awd_mode::disable;
}

template<awd_channel _awd_channel, typename _cr1>
void set_awd_channel(_cr1&& cr1)
{
  cr1 &= ~(ADC_CR1_AWDCH);
  cr1 |= (uint32_t(_awd_channel) << ADC_CR1_AWDCH_Pos);
}

template<typename _module, awd_channel _awd_channel>
void set_awd_channel()
{
  auto inst = detail::inst<_module>();
  uint32_t cr1 = inst->CR1;
  set_awd_channel<_awd_channel>(cr1);
  inst->CR1 = cr1;
}

template<typename _module>
awd_channel get_awd_channel()
{
  const uint32_t cr1 = detail::inst<_module>()->CR1;
  return awd_channel( (cr1 & ADC_CR1_AWDCH) >> ADC_CR1_AWDCH_Pos );
}

template<typename _module>
void set_awd_low(uint16_t val) { detail::inst<_module>()->LTR = val & 0xFFF; }

template<typename _module>
uint16_t get_awd_low() { return detail::inst<_module>()->LTR & 0xFFF; }

template<typename _module>
void set_awd_high(uint16_t val) { detail::inst<_module>()->HTR = val & 0xFFF; }

template<typename _module>
uint16_t get_awd_high() { return detail::inst<_module>()->HTR & 0xFFF; }

template<typename _module, typename ..._modules>
void adc_configure()
{
  if constexpr(_module::dev_class == lmcu::dev_class::adc) {
    auto inst = detail::inst<_module>();

    detail::disable<_module>();

    reg_trig_check<_module>();
    inj_trig_check<_module>();

    switch(_module::module_id)
    {
#if defined(ADC1)
    case module_id::adc1:
      RCC->APB2ENR  |=  RCC_APB2ENR_ADC1EN;
      RCC->APB2RSTR |=  RCC_APB2RSTR_ADC1RST;
      RCC->APB2RSTR &= ~RCC_APB2RSTR_ADC1RST;
      break;
#endif

#if defined(ADC2)
    case module_id::adc2:
      RCC->APB2ENR  |=  RCC_APB2ENR_ADC2EN;
      RCC->APB2RSTR |=  RCC_APB2RSTR_ADC2RST;
      RCC->APB2RSTR &= ~RCC_APB2RSTR_ADC2RST;
      break;
#endif

#if defined(ADC3)
    case module_id::adc3:
      RCC->APB2ENR  |=  RCC_APB2ENR_ADC3EN;
      RCC->APB2RSTR |=  RCC_APB2RSTR_ADC3RST;
      RCC->APB2RSTR &= ~RCC_APB2RSTR_ADC3RST;
      break;
#endif

#if defined(ADC4)
    case module_id::adc4:
      RCC->APB2ENR  |=  RCC_APB2ENR_ADC4EN;
      RCC->APB2RSTR |=  RCC_APB2RSTR_ADC4RST;
      RCC->APB2RSTR &= ~RCC_APB2RSTR_ADC4RST;
      break;
#endif
    }

    if constexpr(_module::awd_mode != awd_mode::disable) {
      set_awd_low<_module>(_module::awd_low);
      set_awd_high<_module>(_module::awd_high);
    }

    uint32_t cr1 = inst->CR1;
    uint32_t cr2 = inst->CR2;

    set_dual_mode<_module::dual_mode>(cr1);
    set_disc_mode<_module::disc_mode>(cr1, cr2);
    set_reg_discnum<_module::reg_discnum>(cr1);
    set_inj_auto<_module::inj_auto>(cr1);
    set_scan<_module::scan>(cr1);
    set_awd_mode<_module::awd_mode>(cr1);
    set_awd_channel<_module::awd_channel>(cr1);
    set_temp_refint<_module::temp_refint>(cr2);
    set_reg_trig<_module::reg_trig>(cr2);
    set_inj_trig<_module::inj_trig>(cr2);
    set_data_align<_module::data_align>(cr2);
    set_dma<_module::dma>(cr2);

