a-sv/lmcu/device/mcu/STM32/detail/adc.h
    inst->CR1 = cr1;
    inst->CR2 = cr2;

    if constexpr(_module::irq.irq_type != nvic::irq_type::disable) {
#ifdef _LMCU_DEVICE_STM32F1_
      nvic::enable_irq<decltype(_module::irq), ADC1_2_IRQn>();
#endif

#ifdef _LMCU_DEVICE_STM32F4_
      nvic::enable_irq<decltype(_module::irq), ADC_IRQn>();
#endif
    }
  }

  if constexpr(sizeof...(_modules) > 0) { adc_configure<_modules...>(); }
}

template<
  uint32_t _mask_1,
  uint32_t _bits_1,
  uint32_t _mask_2,
  uint32_t _bits_2,
  uint32_t _mask_3,
  uint32_t _bits_3,
  module_id _module_id,
  uint8_t _rank,
  typename _chconf,
  typename ..._chconfs
>
constexpr void reg_seqence_configure()
{
  constexpr auto match = []
  {
    if constexpr(_chconf::dev_class == dev_class::adc_reg_channel) {
      return _chconf::module.module_id == _module_id;
    }
    return false;
  }();

  [[maybe_unused]] constexpr auto mask_1 = []() -> uint32_t
  {
    if constexpr(match && _rank >= 12 && _rank <= 15) {
      return _mask_1 | (0x1f << ((_rank - 12) * 5));
    }
    return _mask_1;
  }();

  [[maybe_unused]] constexpr auto bits_1 = []() -> uint32_t
  {
    if constexpr(match && _rank >= 12 && _rank <= 15) {
      return _bits_1 | (_chconf::chan_num << ((_rank - 12) * 5));
    }
    return _bits_1;
  }();

  [[maybe_unused]] constexpr auto mask_2 = []() -> uint32_t
  {
    if constexpr(match && _rank >= 6 && _rank <= 11) {
      return _mask_2 | (0x1f << ((_rank - 6) * 5));
    }
    return _mask_2;
  }();

  [[maybe_unused]] constexpr auto bits_2 = []() -> uint32_t
  {
    if constexpr(match && _rank >= 6 && _rank <= 11) {
      return _bits_2 | (_chconf::chan_num << ((_rank - 6) * 5));
    }
    return _bits_2;
  }();

  [[maybe_unused]] constexpr auto mask_3 = []() -> uint32_t
  {
    if constexpr(match && _rank <= 5) {
      return _mask_3 | (0x1f << (_rank * 5));
    }
    return _mask_3;
  }();

  [[maybe_unused]] constexpr auto bits_3 = []() -> uint32_t
  {
    if constexpr(match && _rank <= 5) {
      return _bits_3 | (_chconf::chan_num << (_rank * 5));
    }
    return _bits_3;
  }();

  if constexpr(sizeof...(_chconfs) > 0) {
    reg_seqence_configure<mask_1, bits_1, mask_2, bits_2, mask_3, bits_3, _module_id,
                          match? _rank + 1 : _rank, _chconfs...>();
  }
  else
  if constexpr(match) {
    [[maybe_unused]] auto inst = detail::inst<_module_id>();

    if constexpr(mask_3) {
      uint32_t r = inst->SQR3;
      r &= ~mask_3;
      r |=  bits_3;
      inst->SQR3 = r;
    }

    if constexpr(mask_2) {
      uint32_t r = inst->SQR2;
      r &= ~mask_2;
      r |=  bits_2;
      inst->SQR2 = r;
    }

    if constexpr(mask_1 || mask_2 || mask_3) {
      uint32_t r = inst->SQR1;

      if constexpr(mask_1) {
        r &= ~mask_1;
        r |=  bits_1;
      }

      r &= ~ADC_SQR1_L;
      r |= _rank << ADC_SQR1_L_Pos;

      inst->SQR1 = r;
    }
  }
}

template<
  uint32_t _jofr_1,
  uint32_t _jofr_2,
  uint32_t _jofr_3,
  uint32_t _jofr_4,
  uint32_t _jsqr,
  module_id _module_id,
  uint8_t _rank,
  typename _chconf,
  typename ..._chconfs
>
constexpr void inj_seqence_configure()
{
  constexpr auto match = []
  {
    if constexpr(_chconf::dev_class == dev_class::adc_inj_channel) {
      return _chconf::module.module_id == _module_id;
    }
    return false;
  }();

  [[maybe_unused]] constexpr auto jofr_1 = []() -> uint32_t
  {
    if constexpr(match && _rank == 0) { return _chconf::data_offset; }
    return _jofr_1;
  }();

  [[maybe_unused]] constexpr auto jofr_2 = []() -> uint32_t
  {
    if constexpr(match && _rank == 1) { return _chconf::data_offset; }
    return _jofr_2;
  }();

  [[maybe_unused]] constexpr auto jofr_3 = []() -> uint32_t
  {
    if constexpr(match && _rank == 2) { return _chconf::data_offset; }
    return _jofr_3;
  }();

  [[maybe_unused]] constexpr auto jofr_4 = []() -> uint32_t
  {
    if constexpr(match && _rank == 3) { return _chconf::data_offset; }
    return _jofr_4;
  }();

  [[maybe_unused]] constexpr auto jsqr = []() -> uint32_t
  {
    if constexpr(match) { return (_jsqr >> 5) | (uint32_t(_chconf::chan_num) << 15); }
    return _jsqr;
  }();

  if constexpr(sizeof...(_chconfs) > 0) {
    constexpr auto rank = match? _rank + 1 : _rank;
    static_assert(rank <= 3, "injected sequence must not have more than 4 channels");
    inj_seqence_configure<jofr_1, jofr_2, jofr_3, jofr_4, jsqr, _module_id, rank, _chconfs...>();
  }
  else
  if constexpr(match) {
    [[maybe_unused]] auto inst = detail::inst<_module_id>();
    inst->JSQR = jsqr | (_rank << ADC_JSQR_JL_Pos);
    switch(_rank) {
    case 3: inst->JOFR1 = jofr_1;
    case 2: inst->JOFR2 = jofr_2;
    case 1: inst->JOFR3 = jofr_3;
    case 0: inst->JOFR4 = jofr_4;
    }
  }
}

template<module_id _module_id, uint8_t _low, uint8_t _high, typename _chconf>
constexpr bool channel_in_range()
{
  if constexpr(
    _chconf::dev_class == dev_class::adc_reg_channel ||
    _chconf::dev_class == dev_class::adc_inj_channel
  ) {
    return _chconf::module.module_id == _module_id && _chconf::chan_num >= _low &&
           _chconf::chan_num <= _high;
  }
  return false;
}

template<module_id _module_id, uint8_t _low, uint8_t _high, typename _chconf,
         typename ..._chconfs>
constexpr uint32_t smpr_mask()
{
  constexpr auto r = []() -> uint32_t
  {
    if constexpr(channel_in_range<_module_id, _low, _high, _chconf>()) {
      return uint32_t(0x7) << ((_chconf::chan_num - _low) * 3);
    }
    return 0;
  }();

  if constexpr(sizeof...(_chconfs) > 0) {
    return r | smpr_mask<_module_id, _low, _high, _chconfs...>();
  }
  return r;
}

template<module_id _module_id, uint8_t _low, uint8_t _high, typename _chconf,
         typename ..._chconfs>
constexpr uint32_t smpr_bits()
{
  constexpr auto r = []() -> uint32_t
  {
    if constexpr(channel_in_range<_module_id, _low, _high, _chconf>()) {
      return uint32_t(_chconf::sample_time) << ((_chconf::chan_num - _low) * 3);
    }
    return 0;
  }();

  if constexpr(sizeof...(_chconfs) > 0) {
    return r | smpr_bits<_module_id, _low, _high, _chconfs...>();
  }
  return r;
}

template<module_id _module_id, typename ..._chconfs>
void sample_rate_conf()
{
  [[maybe_unused]] auto inst = detail::inst<_module_id>();

  {
    constexpr auto mask = smpr_mask<_module_id, 0, 9, _chconfs...>();
    if constexpr(mask != 0) {
      uint32_t r = inst->SMPR2;
      r &= ~mask;
      r |= smpr_bits<_module_id, 0, 9, _chconfs...>();
      inst->SMPR2 = r;
    }
  }

  {
    constexpr auto mask = smpr_mask<_module_id, 10, 17, _chconfs...>();
    if constexpr(mask != 0) {
      uint32_t r = inst->SMPR1;
      r &= ~mask;
      r |= smpr_bits<_module_id, 10, 17, _chconfs...>();
      inst->SMPR1 = r;
    }
  }
}

template<module_id _module_id, typename ..._chconfs>
void reg_chan_configure()
{
  reg_seqence_configure<0, 0, 0, 0, 0, 0, _module_id, 0, _chconfs...>();
  sample_rate_conf<_module_id, _chconfs...>();
}

template<module_id _module_id, typename ..._chconfs>
void inj_chan_configure()
{
  inj_seqence_configure<0, 0, 0, 0, 0, _module_id, 0, _chconfs...>();
  sample_rate_conf<_module_id, _chconfs...>();
}

template<typename _module, typename ..._modules>
void calibrate()
{
  auto inst = detail::inst<_module>();

