a-sv/lmcu/device/mcu/STM32/detail/adc.h
  detail::disable<_module>();

  // wait 2 ADC cycles
  delay::cyc((rcc::system_clock() / rcc::adc_clock()) * 2);

  detail::enable<_module>();

  // reset calibration
  inst->CR2 |= ADC_CR2_RSTCAL;
  while((inst->CR2 & ADC_CR2_RSTCAL) != 0)
    ;

  // start calibration
  inst->CR2 |= ADC_CR2_CAL;
  while((inst->CR2 & ADC_CR2_CAL) != 0)
    ;

  if constexpr(sizeof...(_modules) > 0) { calibrate<_modules...>(); }
}

template<typename _module, typename ..._modules>
void regular_soft_start()
{
  detail::inst<_module>()->CR2 |= ADC_CR2_SWSTART;
  if constexpr(sizeof...(_modules) > 0) { regular_soft_start<_modules...>(); }
}

template<typename _module, typename ..._modules>
void injected_soft_start()
{
  detail::inst<_module>()->CR2 |= ADC_CR2_JSWSTART;
  if constexpr(sizeof...(_modules) > 0) { injected_soft_start<_modules...>(); }
}

template<typename _module>
uint32_t read() { return detail::inst<_module>()->DR; }

template<typename _module, uint8_t _jrank>
uint32_t read()
{
  static_assert(_jrank >= 1 && _jrank <= 4, "rank must be >= 1 and <= 4");

  auto inst = detail::inst<_module>();

  switch(_jrank) {
  case 1: return inst->JDR1;
  case 2: return inst->JDR2;
  case 3: return inst->JDR3;
  case 4: return inst->JDR4;
  default: break;
  }

  return 0;
}

template<typename _module, event ..._events>
event get_flags() { return flags::from_value<event>(detail::inst<_module>()->SR); }

template<typename _module, event ..._events>
void clear_flags()
{
  auto inst = detail::inst<_module>();

  constexpr auto events = (_events + ...);
  static_assert(flags::none(events, event::eoc), "use 'read' function for clear EOC event");

  uint32_t r = 0;
  if constexpr(flags::all(events, event::awd))    { r |= ADC_SR_AWD;   }
  if constexpr(flags::all(events, event::jeoc))   { r |= ADC_SR_JEOC;  }
  if constexpr(flags::all(events, event::jstart)) { r |= ADC_SR_JSTRT; }
  if constexpr(flags::all(events, event::start))  { r |= ADC_SR_STRT;  }
  inst->SR = ~r;
}

template<typename _module, event ..._events>
void enable_events()
{
  auto inst = detail::inst<_module>();

  constexpr auto events = (_events + ...);

  static_assert(flags::none(events, event::start, event::jstart), "events 'start' and 'jstart' "
                                                                  "cannot be enabled");

  uint32_t r = inst->CR1;
  if constexpr(flags::all(events, event::awd))  { r |= ADC_CR1_AWDIE;  }
  if constexpr(flags::all(events, event::eoc))  { r |= ADC_CR1_EOCIE;  }
  if constexpr(flags::all(events, event::jeoc)) { r |= ADC_CR1_JEOCIE; }
  inst->CR1 = r;
}

template<typename _module, event ..._events>
void disable_events()
{
  auto inst = detail::inst<_module>();

  constexpr auto events = (_events + ...);

  static_assert(flags::none(events, event::start, event::jstart), "events 'start' and 'jstart' "
                                                                  "cannot be disabled");

  uint32_t r = inst->CR1;
  if constexpr(flags::all(events, event::awd))  { r &= ~ADC_CR1_AWDIE;  }
  if constexpr(flags::all(events, event::eoc))  { r &= ~ADC_CR1_EOCIE;  }
  if constexpr(flags::all(events, event::jeoc)) { r &= ~ADC_CR1_JEOCIE; }
  inst->CR1 = r;
}

template<typename _module>
event irq_source() { return flags::from_value<event>(detail::inst<_module>()->SR & 0x7); }

template<typename _module>
uint32_t dma_address() { return uint32_t(&detail::inst<_module>()->DR); }

} // namespace detail
